require 'date'

# names
FNAME = %w[Адам Вадим Евгений Никита Адольф Валентин Евдоким Николай Александр Валерий Егор Олег Алексей Василий Ефим Павел Анатолий Виктор Захар Петр Андрей Виталий Иван	 Прохор Антон Владимир Игорь Роман Аристарх Владислав Илья Руслан Аркадий Всеволод Иннокентий Семен Арсен Вячеслав Карл Сергей Артем Гавриил Кирилл	 Станислав Артур Геннадий Клим Степан Аврора Валентина Карина Полина Агнесса Валерия Кира Раиса Агния Варвара Клавдия Регина Ада Венера Клара Римма Алевтина Вера Кристина Роза Александра Вероника Лариса Роксана Алина Виктория Лидия Светлана Алиса Виолетта Лилия Серафима Алла Галина Любовь Софья Альбина Гелла Людмила Стелла Анастасия Дарья Майя Сусанна Ангелина Диана Маргарита Тамара Анжелика Ева Мария Татьяна Анна Евгения Марина Фаина Антонина Екатерина Марта Элеонора]
LNAME = %w[Шнитко Мутко Ляшко Василенко Зеленко Потапченко Глушко Травко Небко Жидко Чфырчко Заволоко Понамаренко Савченко Бойко Гудько Васейко Шнайдер Бегун Мельник Соловей Ткаченко Шевченко Франко Мангалис Каява Кравченко Дрозд Юрченко Малых Фрейман Содель Франд]

# companies
COM = [ "Вам и не снилось", "Лучше наличными", "Зеленоглазое такси", "Какие Люди", "Ы", "Отжигай и жги", "Главбуха нет", "Ооо", "ААА", "Кролики Великаны", "Банк «Прохладный»", "А уедь", "Взятка", "ВСЁ БУДЕТ КРУТО!!!", "ДАА", "Абсолютная власть", "Здравый смысл", "Детка", "Люси", "ФИЛ", "Владимирский Централ", "Ну держись уралмаш", "Тудранктуфак", "Слабо Да", "Мужчина это Бог", "ЧКО", "Хомячки", "Ололо", "Боже, какой мужчина", "Тепленькая пошла", "Нли ю", "Восьмиклассница", "Паньки", "Я—я, натурлих!", "Пошла родимая", "Хотя нет", "Бещёки", "Гудбай, Америка", "Эс как доллар", "Звезда во лбу"]
# cities
CITIES = %w[ Абакан Абинск Агата Агинское Адлер Адыгейск Азов Алагир Алапаевск Алдан Александров Бавлы Байкальск Баксан Балашиха Балашов Балтийск Баргузин Барнаул Батайск Белгород Валаам Валдай Ведено Великие Луки Великий Устюг Вендинга Верещагино Верхнее Пенжино Верхний Баскунчак Кабанск Кажим Казань Калач Калач-на-Дону Калачинск Калевала Калининград Калуга Калязин Каменномостский Каменск-Уральский Каменск-Шахтинский Камень-на-Оби Камышин Камышлов Кандалакша Каневская Канск Карабудахкент Карабулак Карачаевск Каргасок Каргополь Салават Салехард Сальск Самара Санкт-Петербург Саранск Сарапул Саратов Саров Сасово Саянск Светлогорск Северо-Курильск Северобайкальск Северодвинск Североморск Мичуринск Можайск Можга Моздок Мокшан Мончегорск Морозовск Моршанск Москва ]
# tab
T = '	'
# types of company
TYPES = %w[ ооо ип ]

# accountant
def acc amount = 20
	@names = []
	amount.downto(1) do |a| 
		@names << FNAME[rand(FNAME.length)] + ' ' + LNAME[rand(LNAME.length)]
	end

	id = 0

	@names.uniq!
	f = File.open('acc.txt', 'w')
		@names.each do |n|
			id = id + 1
			f.puts id.to_s + T + n
		end
	f.close
end

# companies
def com
	f = File.open('com.txt', 'w')
	id = 0
	COM.each do |c|
		id = id + 1
		f.puts id.to_s + T + c + T + 'Россия' + T + CITIES[rand(CITIES.length)] + T + TYPES[rand(TYPES.length)] + T + rand(1..20).to_s
	end
	f.close
end

# employees
def emp amount = 200
	@names = []
	amount.downto(1) do |a|
		@names << FNAME[rand(FNAME.length)] + ' ' + LNAME[rand(LNAME.length)]
	end
	id = 0
	f = File.open('emp.txt', 'w')
		@names.each do |n|
			id = id + 1
			f.puts id.to_s + T + n + T + rand(15000..50000).to_s + T + rand(1..40).to_s
		end
	f.close
end

# company
def cmp
	@dateE = Date.new(2000,12,31)
	@dateS = Date.new(2000,1,1)

	f = File.open('cmp.txt', 'w')
	40.downto(1) do |c|
		@dateE.downto(@dateS) do |d|
			f.puts c.to_s + T + d.to_s + T + rand(100000).to_s + T + rand(150000).to_s
		end
	end
	f.close
end

# debt
def deb amount=35
	f = File.open('deb.txt', 'w')
		amount.downto(1) do |a|
			id = rand(1..40).to_s
			dst = rand(1..40).to_s
			dst = rand(1..40).to_s if id == dst
			f.puts id + T + rand(1000..200000).to_s + T + dst
		end
	f.close
end